#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
#а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, 
#чтобы все монетки были повернуты вверх одной и той же стороной. 
#Выведите минимальное количество монет, которые нужно перевернуть

import random

n = int(input("Введите количество монет: "))

emblem = random.randint(1, n)  
print("С герборм :", emblem)
print("С решкой :", (n - emblem))
if(emblem > n - emblem):
    print(n - emblem)
else:
    print(emblem)